Repository: burak-albayrak/UnitConverter
Catalog: UnitConverter/Localizable/Localizable.xcstrings
Source language: en
Languages: tr

source: a.u. of length
tr: uzunluk birimi

source: abampere
tr: abamper

source: abampere turn
tr: abamper-turu

source: abampere/square centimeter
tr: abamper/kare santimetre

source: abcoulomb/cubic centimeter
tr: abcoulomb / santimetreküp

source: abcoulomb/cubic inch
tr: abcoulomb / inçküp

source: abcoulomb/cubic meter
tr: abcoulomb / metreküp

source: abcoulomb/square centimeter
tr: abcoulomb/santimetrekare

source: abcoulomb/square inch
tr: abcoulomb/inçkare

source: abcoulomb/square meter
tr: abcoulomb/metrekare

source: abohm centimeter
tr: abohm santimetre

source: About
tr: Hakkında

source: Acceleration
tr: İvme

source: Acceleration - Angular
tr: Açısal İvme

source: Acceleration of gravity
tr: Yerçekimi ivmesi

# AccelerationInfo
source: Acceleration measures the rate at which an object's velocity changes over time. It is a fundamental concept in mechanics and physics, describing how quickly an object speeds up or slows down. The SI unit for acceleration is meters per second squared (m/s²), indicating the change in velocity (in meters per second) that occurs each second. For example, an acceleration of 9.8 m/s² represents the acceleration due to Earth's gravity, causing objects to speed up by 9.8 meters per second each second when falling freely. Acceleration is crucial for understanding motion dynamics, designing vehicles, and analyzing forces in various applications. Accurate measurement of acceleration helps in predicting and controlling the movement of objects and systems.
tr: İvme, bir nesnenin hızının zamanla nasıl değiştiğini ölçer. Mekanik ve fizik alanlarında temel bir kavramdır ve bir nesnenin ne kadar hızlı hızlandığını veya yavaşladığını açıklar. İvmenin SI birimi metre/saniye kare'dir (m/s²), bu bir saniyede meydana gelen hız değişimini (metre/saniye cinsinden) ifade eder. Örneğin, 9.8 m/s²'lik bir ivme, Dünya'nın yerçekimi nedeniyle serbest düşüşteki nesnelerin her saniye 9.8 metre/saniye hızlandığını gösterir. İvme, hareket dinamiklerini anlamak, araç tasarlamak ve çeşitli uygulamalarda kuvvetleri analiz etmek için kritik öneme sahiptir. İvmenin doğru ölçümü, nesnelerin ve sistemlerin hareketini tahmin etmek ve kontrol etmekte yardımcı olur.

source: acre (US survey)
tr: acre (ABD)

source: acre-foot
tr: acre-fit

source: acre-foot (US survey)
tr: acre-fit (ABD)

source: acre-foot/day
tr: acre-fit/gün

source: acre-foot/hour
tr: acre-fit/saat

source: acre-foot/year
tr: acre-fit/yıl

source: acre-inch
tr: acre-inç

source: Add some conversions to your favorites!
tr: Favorilerinize birkaç dönüşüm ekleyin!

source: Added to Favorites
tr: Favorilere Eklendi

source: Afghan Afghani
tr: Afgan Afganisi

source: Albanian Lek
tr: Arnavut Leki

source: Algerian Dinar
tr: Cezayir Dinarı

source: All Converters
tr: Tüm Dönüştürücüler

source: ampere
tr: amper

source: ampere turn
tr: amper-turu

source: ampere turn/meter
tr: amper-dönüş/metre

source: ampere-hour
tr: amper-saat

source: ampere-minute
tr: amper-dakika

source: ampere-second
tr: amper-saniye

source: ampere/circular mil
tr: amper/dairesel mil

source: ampere/square centimeter
tr: amper/kare santimetre

source: ampere/square inch
tr: amper/inç kare

source: ampere/square meter
tr: amper/kare metre

source: ampere/square mil
tr: amper/mil kare

source: Angle
tr: Açı

# AngleInfo
source: An angle represents the space between two intersecting lines or surfaces, measured in degrees or radians. It is a fundamental concept in geometry and trigonometry. The SI unit for angles is the radian (rad), where one radian is the angle formed when the arc length of a circle is equal to the radius. Another common unit is the degree (°), where a full circle is divided into 360 degrees. For example, a right angle is 90°, and a full circle is 360°. Angles are essential in various fields such as navigation, engineering, and physics, helping to describe rotations, slopes, and the orientation of objects. Accurate angle measurement is crucial for precise calculations and designs.
tr: Açı, kesişen iki doğru veya yüzey arasındaki boşluğu temsil eder ve derece veya radyan cinsinden ölçülür. Geometri ve trigonometri alanlarında temel bir kavramdır. Açılar için SI birimi radyandır (rad). Bir radyan, bir çemberin yay uzunluğunun yarıçapına eşit olduğu durumda oluşan açıyı ifade eder. Diğer yaygın birim ise derecedir (°); tam bir çember 360 dereceye bölünür. Örneğin, dik açı 90° ve tam bir çember 360°'dir. Açılar, rotasyonları, eğimleri ve nesnelerin yönelimini tanımlamada gezinme, mühendislik ve fizik gibi çeşitli alanlarda önemlidir. Doğru açı ölçümü, hassas hesaplamalar ve tasarımlar için hayati önem taşır.

source: Angolan Kwanza
tr: Angola Kvanzası

# AngularAccelerationInfo
source: Angular acceleration measures the rate at which an object's angular velocity changes over time. It describes how quickly an object speeds up or slows down its rotation around an axis. The SI unit for angular acceleration is radians per second squared (rad/s²), which represents the change in angular velocity (in radians per second) that occurs each second. For example, if an object's angular velocity increases by 2 rad/s every second, its angular acceleration is 2 rad/s². Angular acceleration is crucial in rotational dynamics, affecting the performance of rotating machinery, the motion of celestial bodies, and the behavior of various mechanical systems. Accurate measurement of angular acceleration helps in designing and analyzing rotational systems and understanding rotational motion.
tr: Açısal ivme, bir nesnenin açısal hızının zamanla nasıl değiştiğini ölçer. Bir nesnenin bir eksen etrafındaki dönüş hızının ne kadar hızlı arttığını veya azaldığını açıklar. Açısal ivmenin SI birimi radyan/saniye kare'dir (rad/s²), bu bir saniyede meydana gelen açısal hız değişimini (radyan/saniye cinsinden) ifade eder. Örneğin, bir nesnenin açısal ivmesi her saniye 2 rad/s artıyorsa, açısal ivmesi 2 rad/s²'dir. Açısal ivme, dönüş dinamiklerinde kritik bir rol oynar ve dönen makinelerin performansını, göksel cisimlerin hareketini ve çeşitli mekanik sistemlerin davranışını etkiler. Açısal ivmenin doğru ölçümü, döner sistemlerin tasarımında ve analizinde yardımcı olur ve dönüş hareketini anlamayı sağlar.

# AngularVelocityInfo
source: Angular velocity measures the rate at which an object rotates around an axis. It quantifies how quickly an angle changes with respect to time and is a key concept in rotational motion. The SI unit for angular velocity is radians per second (rad/s). One radian represents the angle subtended when the arc length of a circle equals the radius. For example, an angular velocity of 2 rad/s means the angle of rotation increases by 2 radians every second. Angular velocity is essential in fields such as physics, engineering, and astronomy for analyzing rotational dynamics, machinery performance, and celestial movements. Accurate measurement of angular velocity is crucial for designing rotating systems and understanding rotational behavior.
tr: Açısal hız, bir nesnenin bir eksen etrafında dönme hızını ölçer. Bir açının zamanla ne kadar hızlı değiştiğini niceliksel olarak ifade eder ve dönüş hareketlerinde temel bir kavramdır. Açısal hızın SI birimi radyan/saniyedir (rad/s). Bir radyan, bir çemberin yay uzunluğunun yarıçapa eşit olduğu açıyı ifade eder. Örneğin, 2 rad/s'lik bir açısal hız, dönüş açısının her saniye 2 radyan arttığını gösterir. Açısal hız, fizik, mühendislik ve astronomi gibi alanlarda dönüş dinamiklerini, makinelerin performansını ve göksel hareketleri analiz etmek için önemlidir. Açısal hızın doğru ölçümü, dönen sistemlerin tasarımı ve dönüş davranışını anlamak için kritik öneme sahiptir.

source: Appearance
tr: Görünüş

# AppName
source: Unit Converter
tr: Birim Dönüştürücü

source: Are you sure you want to clear all favorites? This action cannot be undone.
tr: Tüm favorileri temizlemek istediğinizden emin misiniz? Bu eylem geri alınamaz.

source: Area
tr: Alan

# AreaInfo
source: Area measures the extent of a two-dimensional surface or shape. It quantifies the amount of space within a boundary and is a key concept in geometry, architecture, and various scientific fields. The SI unit for area is the square meter (m²), which represents the area of a square with sides of one meter. Other commonly used units include square kilometers (km²), square centimeters (cm²), and square millimeters (mm²). For instance, one square kilometer equals one million square meters. Area is used to determine the size of land plots, the surface of objects, and the amount of material needed for coverage. Accurate area calculations are essential in tasks ranging from land surveying to designing floor plans.
tr: Alan, iki boyutlu bir yüzeyin veya şeklin genişliğini ölçer. Bir sınır içindeki alan miktarını ifade eder ve geometri, mimari ve çeşitli bilim dallarında önemli bir kavramdır. Alan için SI birimi, bir metre kenar uzunluğuna sahip bir karenin alanını temsil eden metrekaredir (m²). Diğer yaygın olarak kullanılan birimler arasında kilometrekare (km²), santimetrekare (cm²) ve milimetrekare (mm²) bulunur. Örneğin, bir kilometrekare bir milyon metrekareye eşittir. Alan, arazi parsellerinin büyüklüğünü, nesnelerin yüzeyini ve kaplama için gereken malzeme miktarını belirlemek için kullanılır. Alan hesaplamalarının doğru yapılması, arazi ölçümünden zemin planları tasarlamaya kadar birçok görevde hayati öneme sahiptir.

source: Argentine Peso
tr: Arjantin Pesosu

source: Armenian Dram
tr: Ermeni Dramı

source: Aruban Florin
tr: Aruba Florini

source: astronomical unit
tr: astronomik birim

source: atmosphere technical
tr: teknik atmosfer

source: Atomic mass unit
tr: Atomik kütle birimi

source: attohertz
tr: attahertz

source: attoliter
tr: attolitre

source: attometer
tr: attometre

source: attometer/square second
tr: attometre/saniye kare

source: attosecond
tr: attosaniye

source: Australian Dollar
tr: Avustralya Doları

source: Azerbaijani Manat
tr: Azerbaycan Manatı

source: Bahamian Dollar
tr: Bahama Doları

source: Bahraini Dinar
tr: Bahreyn Dinarı

source: Bangladeshi Taka
tr: Bangladeş Takası

source: Barbadian Dollar
tr: Barbados Doları

source: barrel (oil)
tr: varil (petrol)

source: barrel (UK)
tr: varil (İngiltere)

source: barrel (US)
tr: varil (ABD)

source: barrel (US)/day
tr: varil (ABD)/gün

source: barrel (US)/hour
tr: varil (ABD)/saat

source: barrel (US)/minute
tr: varil (ABD)/dakika

source: barrel (US)/second
tr: varil (ABD)/saniye

source: barrel dry (US)
tr: kuru varil (ABD)

source: Belarusian Ruble
tr: Belarus Rublesi

source: Belize Dollar
tr: Belize Doları

source: Bermudan Dollar
tr: Bermuda Doları

source: Bhutanese Ngultrum
tr: Butan Ngultrumu

source: board foot
tr: tahta fit

source: Bohr radius
tr: Bohr yarıçapı

source: Bolivian Boliviano
tr: Bolivya Bolivyanosu

source: Bosnia-Herzegovina Convertible Mark
tr: Bosna-Hersek Konvertibl Markı

source: Botswanan Pula
tr: Botsvana Pulası

source: bougie decimal
tr: bougie ondalık

source: Brazilian Real
tr: Brezilya Reali

source: British Pound Sterling
tr: İngiliz Sterlini

source: Brunei Dollar
tr: Brunei Doları

source: Btu (IT) foot/hour/sq. foot/°F
tr: Btu (IT) fit/saat/kare fit/°F

source: Btu (IT) inch/hour/sq. foot/°F
tr: Btu (IT) inç/saat/kare fit/°F

source: Btu (IT) inch/second/sq. foot/°F
tr: Btu (IT) inç/saniye/kare fit/°F

source: Btu (IT)/cubic foot
tr: Btu (IT)/kübik fit

source: Btu (IT)/hour
tr: Btu (IT)/saat

source: Btu (IT)/hour/square foot
tr: Btu (IT)/saat/kare fit

source: Btu (IT)/hour/square foot/°F
tr: Btu (IT)/saat/kare fit/°F

source: Btu (IT)/minute
tr: Btu (IT)/dakika

source: Btu (IT)/minute/square foot
tr: Btu (IT)/dakika/kare fit

source: Btu (IT)/second
tr: Btu (IT)/saniye

source: Btu (IT)/second/square foot
tr: Btu (IT)/saniye/kare fit

source: Btu (IT)/second/square foot/°F
tr: Btu (IT)/saniye/kare fit/°F

source: Btu (IT)/square foot
tr: Btu (IT)/kare fit

source: Btu (th) foot/hour/sq. foot/°F
tr: Btu (th) fit/saat/kare fit/°F

source: Btu (th) inch/hour/sq. foot/°F
tr: Btu (th) inç/saat/kare fit/°F

source: Btu (th) inch/second/sq. foot/°F
tr: Btu (th) inç/saniye/kare fit/°F

source: Btu (th)/cubic foot
tr: Btu (th)/kübik fit

source: Btu (th)/hour
tr: Btu (th)/saat

source: Btu (th)/hour/square foot
tr: Btu (th)/saat/kare fit

source: Btu (th)/hour/square foot/°F
tr: Btu (th)/saat/kare fit/°F

source: Btu (th)/minute
tr: Btu (th)/dakika

source: Btu (th)/minute/square foot
tr: Btu (th)/dakika/kare fit

source: Btu (th)/second
tr: Btu (th)/saniye

source: Btu (th)/second/square foot
tr: Btu (th)/saniye/kare fit

source: Btu (th)/second/square foot/°F
tr: Btu (th)/saniye/kare fit/°F

source: Btu (th)/second/square inch
tr: Btu (th)/saniye/inçkare

source: Btu (th)/square foot
tr: Btu (th)/kare fit

source: Bulgarian Lev
tr: Bulgar Levası

source: Burundian Franc
tr: Burundi Frangı

source: bushel (UK)
tr: bushel (İngiltere)

source: bushel (US)
tr: bushel (ABD)

source: caliber
tr: kalibre

source: calorie (IT)
tr: kalori (IT)

source: calorie (IT)/cubic centimeter
tr: kalori (IT)/santimetreküp

source: calorie (IT)/gram
tr: kalori (IT)/gram

source: calorie (IT)/gram/°C
tr: kalori (IT)/gram/°C

source: calorie (IT)/gram/°F
tr: kalori (IT)/gram/°F

source: calorie (IT)/hour
tr: kalori (IT)/saat

source: calorie (IT)/hour/square centimeter
tr: kalori (IT)/saat/santimetrekare

source: calorie (IT)/minute
tr: kalori (IT)/dakika

source: calorie (IT)/minute/square centimeter
tr: kalori (IT)/dakika/santimetrekare

source: calorie (IT)/second
tr: kalori (IT)/saniye

source: calorie (IT)/second/cm/°C
tr: kalori (IT)/saniye/cm/°C

source: calorie (IT)/second/square centimeter
tr: kalori (IT)/saniye/santimetrekare

source: calorie (IT)/second/square centimeter/°C
tr: kalori (IT)/saniye/kare santimetre/°C

source: calorie (nutritional)
tr: kalori (besin)

source: calorie (th)
tr: kalori (th)

source: calorie (th)/gram
tr: kalori (th)/gram

source: calorie (th)/gram/°C
tr: kalori (th)/gram/°C

source: calorie (th)/hour
tr: kalori (th)/saat

source: calorie (th)/hour/square centimeter
tr: kalori (th)/saat/santimetrekare

source: calorie (th)/minute
tr: kalori (th)/dakika

source: calorie (th)/minute/square centimeter
tr: kalori (th)/dakika/santimetrekare

source: calorie (th)/second
tr: kalori (th)/saniye

source: calorie (th)/second/cm/°C
tr: kalori (th)/saniye/cm/°C

source: calorie (th)/second/square centimeter
tr: kalori (th)/saniye/santimetrekare

source: calorie (th)/square centimeter
tr: kalori (th)/kare santimetre

source: Cambodian Riel
tr: Kamboçya Rieli

source: Canadian Dollar
tr: Kanada Doları

source: Cancel
tr: İptal

source: candela steradian/sq. meter
tr: kandela steradyan/metrekare

source: candela/square centimeter
tr: kandela/santimetrekare

source: candela/square foot
tr: kandela/fitkare

source: candela/square inch
tr: kandela/inçkare

source: candela/square meter
tr: kandela/metrekare

source: candle (German)
tr: kandela (Alman)

source: candle (international)
tr: kandela (uluslararası)

source: candle (pentane)
tr: kandela (pentan)

source: candle (UK)
tr: kandela (İngiltere)

source: Cape Verdean Escudo
tr: Cape Verde Eskudosu

source: carat
tr: kıta

source: carcel unit
tr: carcel birimi

# CategoriesDescription
source: Whether it’s everyday measurements or advanced scientific units, we’ve got every conversion you need, all in one place
tr: Günlük ölçümlerden gelişmiş bilimsel birimlere kadar, ihtiyacınız olan tüm dönüşümleri tek bir yerde kolayca bulabilirsiniz.

# CategoriesTitle
source: Diverse Conversion Categories
tr: Çeşitli Dönüşüm Kategorileri

source: Cayman Islands Dollar
tr: Cayman Adaları Doları

source: Celsius
tr: Santigrat

source: centigram
tr: santigram

source: centihertz
tr: santihertz

source: centiinch
tr: santiminç

source: centiliter
tr: santilitre

source: centimeter
tr: santimetre

source: centimeter mercury (0°C)
tr: santimetre cıva (0°C)

source: centimeter water (4°C)
tr: santimetre su (4°C)

source: centimeter-candle
tr: santimetre-kandela

source: centimeter/square second
tr: santimetre/saniye kare

source: centipascal
tr: santipascal

source: centipoise
tr: santipoise

source: centistokes
tr: sentistokes

source: centiwatt
tr: santivatt

source: Central African CFA Franc
tr: Orta Afrika CFA Frangı

source: century
tr: yüzyıl

source: CFP Franc
tr: CFP Frangı

source: CGS e.m. unit
tr: CGS e.m. birimi

source: CGS e.s. unit
tr: CGS e.s. birimi

source: chain (US survey)
tr: chain (ABD)

source: Charge
tr: Elektrik Yükü

# ChargeInfo
source: Electric charge is a fundamental property of matter that causes it to experience a force when placed in an electric or magnetic field. It comes in two types: positive and negative, with like charges repelling and opposite charges attracting each other. The SI unit for electric charge is the coulomb (C), where one coulomb is equivalent to the charge of approximately 6.242 × 10¹⁸ elementary charges (such as electrons). Charge is a crucial concept in understanding electrical phenomena and is fundamental to the operation of electronic devices, batteries, and circuits. For example, the flow of electric charge through a conductor constitutes an electric current. Precise measurement and control of electric charge are vital in applications ranging from simple electronic circuits to advanced technology in telecommunications, computing, and energy systems.
tr: Elektrik yükü, maddeye elektriksel veya manyetik bir alana yerleştirildiğinde bir kuvvet deneyimlemesine neden olan temel bir özelliktir. İki tür elektrik yükü vardır: pozitif ve negatif, benzer yükler birbirini iterken zıt yükler birbirini çeker. Elektrik yükünün SI birimi coulomb (C) ile ifade edilir. Bir coulomb, yaklaşık 6.242 × 10¹⁸ temel yük (örneğin elektronlar) kadar bir yükü temsil eder. Elektrik yükü, elektriksel olayları anlamak ve elektronik cihazlar, piller ve devrelerin çalışması için temel bir kavramdır. Örneğin, bir iletken üzerinden geçen elektrik yükü, elektrik akımını oluşturur. Elektrik yükünün hassas ölçümü ve kontrolü, basit elektronik devrelerden ileri teknolojiye kadar geniş bir uygulama yelpazesinde, telekomünikasyon, bilişim ve enerji sistemlerinde kritik öneme sahiptir.

source: Chilean Peso
tr: Şili Pesosu

source: Chinese Yuan
tr: Çin Yuanı

source: CHU/cubic foot
tr: CHU/kübik fit

source: CHU/hour/square foot
tr: CHU/saat/kare fit

source: CHU/hour/square foot/°C
tr: CHU/saat/kare fit/°C

source: circle
tr: çember

source: circular inch
tr: dairesel inç

source: circular mil
tr: dairesel mil

source: circular mil ohm/foot
tr: dairevi mil ohm/fit

source: Clear
tr: Sil

source: Clear All Favorites
tr: Tüm Favorileri Sil

source: Colombian Peso
tr: Kolombiya Pesosu

source: Common Converters
tr: Yaygın Dönüştürücüler

source: Comorian Franc
tr: Komorlar Frangı

source: Concentration - Molar
tr: Konsantrasyon - Molar

source: Concentration Solution
tr: Konsantrasyon Çözeltisi

# ConcentrationMolarInfo
source: Concentration molar, or molarity, measures the concentration of a solute in a solution, expressed as the number of moles of solute per liter of solution. It is represented by the unit mol/L (M). For example, a solution with a molarity of 1 M means there is one mole of solute dissolved in one liter of solution. Molar concentration is a fundamental concept in chemistry, used to prepare solutions, conduct reactions, and determine the concentrations of reactants and products in chemical processes. Accurate calculation and measurement of molar concentration are crucial for precise chemical analysis, laboratory experiments, and industrial processes, ensuring the correct proportions and reactivity of chemical substances.
tr: Konsantrasyon molar ya da molarite, bir çözeltideki bir çözeltinin konsantrasyonunu ölçer ve çözeltinin her bir litresi başına çözeltinin mol sayısını ifade eder. Birimi mol/L (M) ile gösterilir. Örneğin, 1 M'lik bir çözeltide bir litre çözeltide bir mol çözeltinin çözündüğü anlamına gelir. Molar konsantrasyon, kimyasal reaksiyonların yapılması, çözeltilerin hazırlanması ve kimyasal süreçlerde reaktörlerin ve ürünlerin konsantrasyonlarının belirlenmesi gibi kimyada temel bir kavramdır. Molar konsantrasyonun doğru hesaplanması ve ölçülmesi, hassas kimyasal analizler, laboratuvar deneyleri ve endüstriyel süreçler için çok önemlidir. Bu, kimyasal maddelerin doğru oranlarını ve reaktivitesini sağlamak için gereklidir.

# ConcentrationSolutionInfo
source: Concentration solution refers to the amount of solute present in a given volume of solvent or solution. It is typically expressed in terms such as molarity (moles per liter), molality (moles per kilogram of solvent), or mass percent (mass of solute per mass of solution). For instance, a solution with a concentration of 0.5 M indicates that there are 0.5 moles of solute dissolved in one liter of solution. Concentration is crucial in various fields, including chemistry, biology, and environmental science, as it affects the rate and extent of chemical reactions, biological processes, and pollutant levels. Accurate measurement and control of solution concentration are essential for preparing solutions with precise properties, conducting experiments, and ensuring the effectiveness of chemical and biological processes.
tr: Çözeltinin konsantrasyonu, belirli bir hacimdeki çözücünün veya çözeltinin içindeki çözeltinin miktarını ifade eder. Genellikle molarite (litre başına mol), molalite (çözücünün kilogramı başına mol) veya kütle yüzdesi (çözelti kütlesi başına çözeltinin kütlesi) gibi terimlerle ifade edilir. Örneğin, 0.5 M'lik bir çözeltide, bir litre çözeltide 0.5 mol çözeltinin çözündüğünü gösterir. Konsantrasyon, kimya, biyoloji ve çevre bilimleri gibi çeşitli alanlarda kritik öneme sahiptir çünkü kimyasal reaksiyonların hızı ve kapsamını, biyolojik süreçleri ve kirletici seviyelerini etkiler. Çözeltinin konsantrasyonunun doğru ölçülmesi ve kontrol edilmesi, kesin özelliklere sahip çözeltilerin hazırlanması, deneylerin yapılması ve kimyasal ve biyolojik süreçlerin etkinliğinin sağlanması için gereklidir.

source: Congolese Franc
tr: Kongo Frangı

source: Copied to Clipboard
tr: Pano'ya Kopyalandı

source: copy
tr: kopyala

source: cord
tr: kord

source: Cosmic velocity - first
tr: kozmetik hız - birinci

source: Cosmic velocity - second
tr: kozmetik hız - ikinci

source: Cosmic velocity - third
tr: kozmetik hız - üçüncü

source: Costa Rican Colón
tr: Kosta Rika Kolonu

source: coulomb/cubic centimeter
tr: coulomb / santimetreküp

source: coulomb/cubic inch
tr: coulomb / inçküp

source: coulomb/cubic meter
tr: coulomb / metreküp

source: coulomb/square centimeter
tr: kulomb/santimetrekare

source: coulomb/square inch
tr: kulomb/inçkare

source: coulomb/square meter
tr: kulomb/metrekare

source: Croatian Kuna
tr: Hırvatistan Kunası

source: Cuban Peso
tr: Küba Pesosu

source: cubic centimeter
tr: küp santimetre

source: cubic centimeter/day
tr: santimetreküp/gün

source: cubic centimeter/gram
tr: santimetreküp/gram

source: cubic centimeter/hour
tr: santimetreküp/saat

source: cubic centimeter/minute
tr: santimetreküp/dakika

source: cubic centimeter/second
tr: santimetreküp/saniye

source: cubic decimeter
tr: küp desimetre

source: cubic foot
tr: küp fit

source: cubic foot/hour
tr: küp fit/saat

source: cubic foot/kilogram
tr: küp feet/kilogram

source: cubic foot/minute
tr: küp fit/dakika

source: cubic foot/pound
tr: küp feet/pound

source: cubic foot/second
tr: küp fit/saniye

source: cubic inch
tr: küp inç

source: cubic inch/hour
tr: küp inç/saat

source: cubic inch/minute
tr: küp inç/dakika

source: cubic inch/second
tr: küp inç/saniye

source: cubic kilometer
tr: küp kilometre

source: cubic meter
tr: küp metre

source: cubic meter/day
tr: metreküp/gün

source: cubic meter/hour
tr: metreküp/saat
